---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn2
source: html/17fe5354-3f2a-b3f9-7d90-31b9bc0da9eb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn2 Property

"Exterior Minor Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientFrontDirn2 { get; }
```